** Practice Problem 3.44

For each of the following structure declarations, determine the offset of each field,
the total size of the structure, and its alignment requirement for x86-64


#+name: includes
#+begin_src scheme :noweb yes
(use-modules (ice-9 format))
#+end_src

#+RESULTS: includes
: #<unspecified>

#+name: showoffsets
#+begin_src scheme :noweb yes
  (define showoffsets
    (lambda (ls)
      (if (nil ls)
          '()
          (display (showoffsets (car ls))))))
#+end_src

(defun ad/eval-nodes (ls)
  "Evaluate all the nodes of a list"
  (if (null ls)
  
  

A. src_C{struct P1 { short i; int c; int *j; short *d; };}

#+begin_src 
  Offset   0    2       6                14                22
           +----+-------+----------------+----------------+
  Contents | i  |   c   |      j         |          d     |
           +----+-------+----------------+----------------+
  
#+end_src

B. src_C{struct P2 {int i[2]; char c[8]; short s[4]; long *j;};}

(+ (* 4 2) (* 1 8) (* 2 4) (* 8 1)) 32 bytes required
Offsets:
0, 8, 16, 24, 32

C. src_C{struct P3 {long w[2]; int *c[2] };}

(+ (* 8 2) (* 8 2)) 32 bytes required
Offsets:
0, 16, 32


D. src_C{struct P4 {char w[16]; char* [2] }; }

(+ (* 1 16) (* 8 2)) 32 bytes required
Offsets:
0, 16, 32

E. src_C{struct P4 a[2]; struct P1 t};


